app/views/shared/_menu.html.erb

<li><%= link_to 'Statistics', statistics_path %></li>
<li><%= link_to('New attempt ('+current_user.attempts.count.to_s+')', new_attempt_path) if current_user %></li>
---
SELECT COUNT(*) FROM "attempts" WHERE "attempts"."user_id" = 2