app/controllers/attempts_controller.rb

  def create
    word = Word.find params[:attempt][:word_id]

    attempt = Attempt.new
    attempt.word_id = params[:attempt][:word_id]
    attempt.is_correct = !!(params[:attempt][:version] == word.slov)

    # ld is method for levenstine range calculation. method defined in libs
    attempt.distance = ld(word.slov, params[:attempt][:version])
    attempt.user_id = current_user.id
    attempt.save!
---
SELECT "words".* FROM "words" WHERE "words"."id" = $1 LIMIT 1  [["id", "283"]]
INSERT INTO "attempts" ("created_at", "distance", "is_correct", "updated_at", "user_id", "word_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Tue, 10 Apr 2012 15:10:18 UTC +00:00], ["distance", 0], ["is_correct", true], ["updated_at", Tue, 10 Apr 2012 15:10:18 UTC +00:00], ["user_id", 1], ["word_id", 283]]