app/controllers/graphs_controller.rb

SELECT "attempts".* FROM "attempts" WHERE "attempts"."user_id" = 1 AND (created_at > '2012-02-10 00:00:00.000000' and created_at < '2012-02-11 00:00:00.000000')
SELECT COUNT(*) FROM "attempts" WHERE "attempts"."user_id" = 2
---
  def index
      respond_to do |format|
        format.html do
          @graph = open_flash_chart_object( 750, 330, url_for( :action => 'index', :format => :json ) )
        end
        format.json do
          data = []
          y_max = 0
          start_point = 2.month.ago
          end_point = Date.today

          (start_point.to_date..end_point).to_a.map{|item| item.to_s(:db)}.each do |day|
            x = day.to_time.to_i

            attempts = current_user.attempts.all(:conditions => ['created_at > ? and created_at < ?', day.to_date.at_beginning_of_day, day.to_date.tomorrow.at_beginning_of_day])
            unless attempts.empty?