app/controllers/statistics_controller.rb

  def index
    @words = Word.all(:include => :attempts).sort_by{|item| item.good_attempts_percent(current_user)}
    @total_attempts = current_user.attempts.count
    @total_good_attempts = current_user.attempts.count(:conditions => {:is_correct => true})
---
SELECT "words".* FROM "words"
SELECT distance FROM "attempts" WHERE "attempts"."user_id" = 2 AND (created_at > '2012-04-09 20:08:45.207078')
SELECT COUNT(*) FROM "attempts" WHERE "attempts"."user_id" = 2
SELECT COUNT(*) FROM "attempts" WHERE "attempts"."user_id" = 2 AND "attempts"."is_correct" = 't'

  def show
    days_counter = params[:id].to_i || 1
    attempts = current_user.attempts.all(:conditions => ['created_at > ?', days_counter.days.ago])
---
SELECT "attempts".* FROM "attempts" WHERE "attempts"."user_id" = 2 AND (created_at > '2012-04-09 20:14:41.124645')
SELECT COUNT(*) FROM "attempts" WHERE "attempts"."user_id" = 2